Repository: skoleapp/skole-backend
Catalog: skole/locale/*/LC_MESSAGES/django.po
Languages: fi, sv

source: P.S. You can always reply to our emails.
sv: P.S. Du kan alltid svara på vår e-post.

source: Hello
sv: Hej

source: Your data request has completed. The data will be accessible for %(days)s days with the following link:
sv: Din dataförfrågan har slutförts. Data kommer att vara tillgänglig för %(days)s dagar med följande länk:

source: Reset your password on the link:
sv: Återställ ditt lösenord på länken:

source: Please verify your account on the link:
sv: Kontrollera ditt konto på länken:

source: Skole Administration
fi: Skolen hallinta
sv: Skole administrering

source: English
fi: Englanti
sv: Engelska

source: Finnish
fi: Suomi
sv: Finska

source: Swedish
fi: Ruotsi
sv: Svenska

source: This username is taken.
fi: Käyttäjänimi on jo käytössä.
sv: Användarnamnet är upptaget.

source: This email is taken.
fi: Sähköposti on jo käytössä.
sv: Den här e-postadressen är upptagen.

source: A subscription with this email already exists.
sv: Det finns redan en prenumeration med det här e-postmeddelandet.

source: This email belongs to an account. You can edit your email preferences in your account settings.
sv: Det här e-postmeddelandet tillhör ett konto. Du kan redigera dina e-postinställningar idina kontoinställningar.

source: This account has been deactivated!
fi: Tämä tili on poistettu käytöstä!
sv: Detta konto har inaktiverats!

source: Invalid username/email or password.
fi: Käyttäjätunnus/sähköposti ja salasana eivät täsmää.
sv: Ogiltigt användarnamn / e-postadress eller lösenord.

source: Cannot log in at this time.
fi: Ei voi kirjautua tällä hetkellä.
sv: Kan inte logga in just nu.

source: Invalid old password.
fi: Väärä vanha salasana.
sv: Ogiltigt gammalt lösenord.

source: Invalid password.
fi: Väärä salasana.
sv: Felaktigt lösenord.

source: Mutation needs exactly one target.
fi: Mutaatio sisältää liian monta kohdetta.
sv: Mutationen innehåller för många mål.

source: You are not the owner of this object.
fi: Et ole tämän objektin omistaja.
sv: Du är inte ägare av detta objekt.

source: File is too large, maximum allowed is {} MB
fi: Tiedosto on liian suuri, suurin sallittu on {}Mt
sv: Filen är för stor, största tillåtna filstorlek {}MB

source: Invalid file type, allowed types are: {}
fi: Virheellinen tiedostotyyppi, sallittuja ovat: {}
sv: Ogiltig filtyp, tillåtna typer är: {}

source: File extension doesn't match the file type.
fi: Tiedostopääte ei vastaa tiedoston tyyppiä.
sv: Tiedostopääte ja tiedostotyyppi eivät täsmää.

source: Comment must include either text or attachment.
sv: Kommentaren måste innehålla antingen text eller bilaga.

source: Usernames can only contain letters, numbers, and underscores.
fi: Käyttäjänimi voi sisältää ainoastaan kirjaimia, numeroita ja alaviivoja.
sv: Användarnamn kan bara innehålla bokstäver, siffror och understreck.

source: File could not be converted to {} format.
fi: Tiedostoa ei pystytty muuttamaan {} muotoon.
sv: Filen kunde inte konverteras till {}-format

source: You cannot vote your own content.
fi: Et voi äänestää omaa sisältöäsi.
sv: Du kan inte rösta på ditt eget innehåll.

source: One of the course codes is invalid.
sv: En av kurskoderna är ogiltig.

source: Invalid ordering value.
fi: Virheellin järjestyarvo.
sv: Ogiltigt sorteringsvärde.

source: This account has already been verified.
fi: Tämä tili on jo vahvistettu.
sv: Det här kontot har redan verifierats.

source: This account is not verified.
fi: Tätä tiliä ei ole vahvistettu.
sv: Det här kontot har inte verifierats

source: This token is not intended for this use.
fi: Tunnus ei ole tarkoitettu tähän käyttötarkoitukseen.
sv: Detta token är inte avsett för detta bruk.

source: An error occurred. Trying again might help.
fi: Tapahtui virhe. Uudelleen yrittäminen saattaa auttaa.
sv: Ett fel uppstod. Men du kan försöka igen.

source: Message sent successfully.
fi: Viesti lähetetty onnistuneesti.
sv: Meddelandet har skickats.

source: Registered new user successfully!
fi: Uusi käyttäjä rekisteröity onnistuneesti.
sv: Ny användare registrerad framgångsrikt!

source: Account verified successfully!
fi: Tili vahvistettu onnistuneesti.
sv: Kontot har verifierats!

source: Verification link sent successfully!
fi: Vahvistuslinkki lähetetty onnistuneesti.
sv: Verifieringslänken har skickats!

source: Password reset link sent successfully!
fi: Salasanan nollauslinkki lähetetty onnistuneesti.
sv: Länk till återställning av lösenord har skickats!

source: Password updated successfully!
fi: Salasana päivitetty onnistuneesti.
sv: Lösenordet har uppdaterats!

source: Logged in successfully!
fi: Kirjauduttu sisään onnistuneesti.
sv: Inloggad!

source: Account deleted successfully!
fi: Tili poistettu onnistuneesti.
sv: Kontot har tagits bort!

source: Profile updated successfully!
fi: Profiili päivitetty onnistuneesti.
sv: Profilen har uppdaterats!

source: Account settings updated successfully!
fi: Tilin asetukset päivitetty onnistuneesti.
sv: Kontoinställningarna har uppdaterats!

source: Course created successfully!
sv: Kurs skapad!

source: Course deleted successfully!
sv: Kurs raderad!

source: Resource deleted successfully!
sv: Resurs raderad!

source: Resource created successfully!
sv: Resurs skapad!

source: Resource updated successfully!
sv: Resurs har uppdaterats!

source: Resource downloads updated!
sv: Resursnedladdningar uppdaterade!

source: Comment updated successfully!
fi: Kommentti päivitetty onnistuneesti.
sv: Kommentaren har uppdaterats!

source: Comment deleted successfully!
fi: Kommentti poistettu onnistuneesti.
sv: Kommentaren raderad!

source: Data request received successfully!
fi: Datapyyntö vastaanotettu!
sv: Dataförfrågan mottagen!

source: Subscribed successfully!
sv: Prenumerera framgångsrikt!

source: Subscription updated successfully!
sv: Prenumerationen uppdaterades!

source: Subscription deleted successfully!
sv: Prenumerationen har tagits bort!

source: Changed the tracked badge successfully!
fi: Seurattava merkki vaihdettu onnistuneesti!
sv: Ändrade det spårade märket!

source: FCM token updated!
sv: FCM-token uppdaterad!

source: Your data request on Skole
sv: Din dataförfrågan på Skole

source: Verify your account on Skole
sv: Verifiera ditt konto på Skole

source: Reset your password on Skole
sv: Återställ ditt lösenord på Skole

source: Community User
sv: Gemenskapsanvändare

source: Error while sending email.
fi: Virhe lähettäessä sähköpostia.
sv: Fel vid sändning av meddelande.

source: Your account has been registered but we encountered an error while sending email. You may still log in using your credentials. Please try verifying your account later.
fi: Tilisi on rekisteröity, mutta sähköpostia lähtetettäessä sattui virhe. Voit silti kirjautua tiedoillasi. Ole hyvä ja yritä vahvistaa tilisi myöhemmin.
sv: Ditt konto har registrerats men vi stötte på ett fel när vi skickade e-post. Du kan fortfarande logga in med dina referenser. Försök verifiera ditt konto senare.

source: Token expired. Please request new verification link.
fi: Tunnus on vanhentunut. Ole hyvä ja pyydä uutta vahvistuslinkkiä.
sv: Token har löpt ut. Begär ny verifieringslänk.

source: Invalid token. Please request new verification link.
fi: Virheellinen tunnus. Ole hyvä ja pyydä uuutta vahvistuslinkkiä.
sv: Ogiltigt token. Begär ny verifieringslänk.

source: Invalid token.
sv: Ogiltigt token.

source: Invalid badge.
fi: Virheellinen merkki.
sv: Ogiltigt märken.

source: User with the provided email was not found. Please check you email address.
fi: Käyttäjää ei löytynyt antamallasi sähköpostiosoitteella. Ole hyvä ja tarkista sähköpostiosoitteesi.
sv: Användare med den medföljande e-postadressen hittades inte. Kontrollera din e-postadress.

source: This account has been removed.
fi: Tämä tili on poistettu.
sv: Det här kontot har tagits bort.

source: Token expired. Please request new password reset link.
fi: Tunnus on vanhentunut. Ole hyvä ja pyydä uutta salasanan nollauslinkkiä.
sv: Token har löpt ut. Be om ny länk för återställning av lösenord.

source: Invalid token. Please request new password reset link.
fi: Virheellinen tunnus. Ole hyvä ja pyydä uutta salasanan nollauslinkkiä.
sv: Ogiltigt token. Be om ny länk till återställning av lösenord.

source: This action is only allowed for authenticated users.
fi: Tämä toiminto on sallittu ainoastaan kirjautuneille käyttäjille.
sv: Den här åtgärden är endast tillåten för autentiserade användare.

source: This action is only allowed for users who have verified their accounts. Please verify your account.
fi: Tämä toiminto on sallittu ainoastaan käyttäjille jotka ovat vahvistaneet tilinsä. Ole hyvä ja vahista tilisi.
sv: Den här åtgärden är endast tillåten för användare som har verifierat sina konton.Bekräfta ditt konto.

source: You can request this next time in {} min.
fi: Voit pyytää tätä uudestaan {} minuutin kuluttua.
sv: Du kan begära detta igen inom {} min.

source: Freshman
fi: Fuksi
sv: Gulis

source: Tutor
fi: Tuutori
sv: Handledare

source: Bachelor
fi: Kandidaatti
sv: Kandidat

source: Master
fi: Maisteri
sv: Magister

source: Doctor
fi: Tohtori
sv: Doktor

source: username
fi: käyttäjänimi
sv: användarnamn

source: email
fi: sähköposti
sv: e-post

source: The password is too similar to the %(verbose_name)s.
fi: Salasana on liian samankaltainen kuin %(verbose_name)s.
sv: Lösenordet är för likt %(verbose_name)s.

source: Your backup email is already verified.
fi: Olet jo vahvistanut varasähköpostisi.

source: Your backup email cannot be the same as your primary email.
fi: Varasähköpostiosoitteesi ei voi olla sama kuin varsinainen osoitteesi.

source: Comment must include either text, an image or a file.
fi: Kommentissa tulee olla tekstiä, kuva tai tiedosto.

source: Comment can contain either an image or a file, but not both.
fi: Kommentissa vois olla joko kuva tai tiedosto, mutta ei molempia.

source: The email address domain is not allowed.
fi: Sähköposti ei ole sallittujen joukossa.

source: You cannot set someone else to be the author of your comment.
fi: Et voi asettaa ketään muuta kommenttisi luojaksi.

source: You have already activated your account with a invite code.
fi: Olet jo aktivoinut käyttäjäsi kutsukoodilla.

source: The invite code does not seem to be valid.
fi: Kutsukoodi on virheellinen.

source: You need to use an invite code before you can log in.
fi: Sinun tulee käyttää kutsukoodi ennen kuin voit kirjautua sisään.

source: You need to use an invite code before validating your email.
fi: Sinun tulee käyttää kutsukoodi ennen sähköpostisi vahvistamista.

source: The invite code does not have any uses left.
fi: Kutsukoodi on jo käytetty.

source: Verified users cannot use invite codes.
fi: Vahvistetut käyttäjät eivät voi käyttää kutsukoodeja.

source: Backup email verified successfully!
fi: Varasähköposti vahvistettu onnistuneesti.

source: Successfully used the invite code!
fi: Kutsukoodi käytetty!

source: Thread created successfully!
fi: Lanka luotu onnistuneesti.

source: Thread deleted successfully!
fi: Lanka poistettu onnistuneesti.

source: Mentor
fi: Mentori

source: Professor
fi: Professori
