Repository: skoleapp/skole-backend
Catalog: core/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Invalid beta register code.
fi: Virheellinen beta-rekisteröitymiskoodi.

source: Cannot log in as superuser.
fi: Ei voi kirjautua pääkäyttäjänä.

source: This email is taken.
fi: Sähköposti on jo käytössä.

source: Incorrect old password.
fi: Vanha salasana väärin

source: Incorrect password.
fi: Väärä salasana.

source: Comment must include either text or attachment.
fi: Kommentissa tulee olla tekstiä tai liite.

source: Message sent successfully.
fi: Viesti lähetetty onnistuneesti.

source: Error while sending message.
fi: Virhe lähettäessä viestiä.

source: User deleted successfully.
fi: Käyttäjä poistettu onnistuneesti.

source: Object deleted successfully.
fi: Objekti poistettu onnistuneesti.

source: Mutation contains too many targets.
fi: Mutaatio sisältää liian monta kohdetta.

source: Invalid username or password.
fi: Käyttäjätunnus ja salasana eivät täsmää.

source: You are not the owner of this object.
fi: Et ole tämän objektin omistaja.

source: English
fi: englanti

source: Finnish
fi: suomi

source: Swedish
fi: ruotsi

source: This username is taken.
fi: Käyttäjänimi on jo käytössä.

source: You can't vote for your own content.
fi: Et voi äänestää omaa sisältöäsi.

source: File is too large, maximum allowed is {}MB
fi: Tiedosto on liian suuri, suurin sallittu on {}Mt

source: Invalid file type, allowed types are: {}
fi: Virheellinen tiedostotyyppi, sallittuja on: {}
